[
    {
        "title": "Jake Daniels: Jordan Henderson's move to Saudi Arabia a 'slap in the face'",
        "time": "22 November 2023",
        "content": "Last updated on  22 November 2023 22 November 2023 . From the section  England midfielder Jordan Henderson's Saudi Arabia move felt like a \"slap in the face\" following his support of the LGBTQ+ community, says Jake Daniels. Daniels, 18, is the UK's only openly gay active male professional footballer and received a message of support from Henderson  after he came out last year. But the Blackpool forward told BBC's Newsbeat he had not heard from Henderson since the former Liverpool captain's move to Saudi club Al-Ettifaq in July. Henderson, 33, was criticised by some LGBTQ+ campaigners over his transfer to Saudi, where same-sex sexual activity is illegal, after he had previously publicly shown support for the LGBTQ+ community. Speaking to the BBC for the first time since coming out 18 months ago, Daniels also discussed: In May 2022, Daniels became the first active professional in the UK men's game to come out since Justin Fashanu in 1990. He said that after coming out, he received a private message of support on his social media account from Henderson, which he has kept. Daniels said: \"He was backing me and said: 'We're proud of what you've done.' \"Seeing him move to Saudi, it kind of like, slaps me in my face really. \"But I guess the money pays well, and money must mean more to people.\" Henderson was one of dozens of elite players at top European clubs who moved to Saudi Pro League side Al-Ettifaq as part of a  huge state investment  into the domestic game. He wrote a long piece for the Liverpool matchday programme in November 2021, expressing support for Stonewall's Rainbow Laces campaign.  Henderson said in September that  he had been \"really hurt\"  by the criticism he has received, insisting his intention had \"always been to help causes and communities\" and that he had not \"changed as a person\". Daniels said it was also \"frustrating\" to see former Liverpool midfielder Steven Gerrard become Al-Ettifaq's manager in July. He added: \"I met him in person and he said: 'If you ever want to get in contact then message me' - but he moved over.\" The BBC has approached Henderson and Gerrard for comment. Daniels said he \"really struggled\" with his mental health over a six-month period before he was able to accept his sexuality and come out. \"Having a lot of male friends at school made it feel like it was bad to be gay - and that obviously made it difficult because it felt like if I came out there, I'd be losing all my friends,\" he said. \"I was around football 24/7 because that was the only thing that took my mind away from everything else.\"  But Daniels said when he came out, first sending a message to his mum and sister in a group chat, the sense of relief had him \"dancing around the room\". \"It has been crazy since coming out,\" Daniels said. \"I didn't think it would blow up as much as it did. The reception I've had, the people I've met, it's been a crazy experience.  \"Coming out was the best thing I've ever done. I'm playing better now.\" While the response Daniels received was overwhelmingly positive, he said the decision to come out was made more difficult by the lack of other high-profile gay men in football. Czech Republic's  Jakub Jankto  became only the second current openly gay top-flight male professional footballer in the world in February, after Adelaide United player Josh Cavallo in October 2021. Australian Cavallo, 24, told BBC Sport in March  he still receives death threats  after coming out as gay. \"It was going into the unknown, that's what it was,\" Daniels told the BBC's LGBT Sport Podcast. \"There were times where I wondered if this was going to affect the moves that I get. If I go out on loan, am I going to be scared to be in a dressing room with older people who might have a different view on gay males? \"There were a lot of things to consider but I was getting injured, I wasn't eating properly, I wasn't sleeping. It just made everything so much worse. I just knew that I had to come out.\" Daniels hopes the experiences of him, Cavallo and Jankto will lead to more male footballers feeling comfortable enough to come out. However, the ongoing challenges faced by the LGBTQ+ community in football have been highlighted by the decision to host the 2022 World Cup in Qatar, where homosexuality is illegal because it is considered immoral under Islamic Sharia law. Saudi Arabia is set to host the  2034 tournament  and the country's Pro League has become increasingly appealing to footballers. \"We were starting to see a bit of progress,\" said Daniels. \"Then the Qatar World Cup happens and we go back again. \"If I was involved in the World Cup and went over, I wouldn't feel safe, and that's putting my football in jeopardy.\"  But Daniels hopes incremental progress can continue to be achieved in the UK - and especially in the Premier League, which remains without any openly gay players. \"I'd like to see another top-flight footballer come out as gay,\" he said.  \"Premier League players obviously have so much more pressure on them and so many more eyes on them, but I just feel that to have more footballers come out would be the start of it.  \"We'd have a little group that could push things. I want to be a role model, but I also want to change the game as much as I can.\"  The relatively slow progress in the men's game is in contrast to women's football. Roughly  13% of players  at the 2023 Women's World Cup identified as LGBTQ+, demonstrating strong representation at the game's highest level. \"In men's football, it comes down to strength,\" said Daniels. \"I feel like players, if they come out as gay, are [worried they are] going be seen as weak. \"I want to speak to female footballers about why [it feels easier to come out].\" Daniels did have role models from other sports to follow, including Olympic diving champion Tom Daley, who inspired him to make the decision to come out. \"He's helped me through so much,\" said Daniels. \"When I came out he messaged me and I asked him questions about how people reacted to him coming out. \"Seeing him be the person he is, as a gay male and also an Olympian or a sportsperson like myself, it proved to me you can be yourself, you can do what you want to do, and people's opinions don't matter.\""
    }
]